Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 128, 32, 32)       896       
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 128, 32, 32)       9248      
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 64, 16, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 16, 64)        18496     
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 64, 16, 64)        36928     
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 32, 8, 64)         0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 32, 8, 128)        73856     
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 32, 8, 128)        147584    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 16, 4, 128)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 16, 4, 256)        295168    
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 16, 4, 256)        590080    
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 8, 2, 256)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 4096)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               1048832   
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 257       
_________________________________________________________________
activation_2 (Activation)    (None, 1)                 0         
=================================================================
Total params: 2,287,137
Trainable params: 2,287,137
Non-trainable params: 0
_________________________________________________________________
